&НаКлиенте
Процедура ОсновыПрограммирование(Команда) 

а = "1"; //1

б = а + 1; //2

Сообщить(б); //3

Сообщить(ТипЗнч(б)); //4;

в = 1 + а; //5

Сообщить(в); //6

Сообщить(ТипЗнч(в)); //7

	Строка = "Пример строки"; //1
Сообщить(Строка);
МногострочнаяСтрока = "Пример
            |многострочной
            |строки"; //2
Сообщить(МногострочнаяСтрока);
МногострочнаяСтрокаДопустимо = "Можно" //3
                        "писать"
                        "так";
Сообщить(МногострочнаяСтрокаДопустимо);
Организация = "ООО ""Рога и копыта"""; //4
Сообщить(Организация);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Номенклатура);
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСуммаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьЦенуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры