Функция ПроверитьСтатусОказанияУслуги(ДокументЗК) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументЗК);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаписьКлиента.УслугаОказана КАК УслугаОказана,
	|	ЗаписьКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаписьКлиента КАК ЗаписьКлиента
	|ГДЕ
	|	ЗаписьКлиента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаписьКлиента.УслугаОказана,
	|	ЗаписьКлиента.Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.УслугаОказана;
КонецФункции