  &НаКлиенте
Процедура БессрочныйДоговорПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


    &НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если НЕ ЗначениеЗаполнено (Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли;	
КонецПроцедуры



&НаКлиенте   


Процедура УстановитьВидимость()

Если Объект.БессрочныйДоговор Тогда //1

    Элементы.СрокДействияДоговора.Видимость = Ложь;

    Если ЗначениеЗаполнено(Объект.СрокДействияДоговора) Тогда //2

        Объект.СрокДействияДоговора = '0001,01,01';

    КонецЕсли;

Иначе

    Элементы.СрокДействияДоговора.Видимость = Истина;

КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВнешнийНомерДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры


 &НаКлиенте
 Процедура СформироватьНаименованиеДоговора()
	 
	Если ЗначениеЗаполнено(Объект.ВнешнийНомерДоговора)
		 И ЗначениеЗаполнено(Объект.ДатаЗаключения) Тогда
		 Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора + " от " + Объект.ДатаЗаключения;
	ИначеЕсли ЗначениеЗаполнено (Объект.ВнешнийНомерДоговора)
		И НЕ ЗначениеЗаполнено (Объект.ДатаЗаключения) Тогда
		Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора;
	Иначе
		Объект.Наименование = " от " + Объект.ДатаЗаключения;
		 
КонецЕсли;
	 
	 
	 
	 
КонецПроцедуры	                         