Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.УчетнаяПолитика = УчетнаяПолитика;
	Если УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.ПоСредней Тогда
		Движения.ТоварыНаСкладах.Записывать = Истина;
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
		Блокировка.Заблокировать();
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|    ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|    ТоварыНаСкладахОстатки.Склад КАК Склад,
		|    ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		|    ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
		|    ТоварыНаСкладахОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|    РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов, ) КАК ТоварыНаСкладахОстатки";
		Запрос.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени()));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение = Движения.ТоварыНаСкладах.ДобавитьПриход();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка,,"СрокГодности");
		КонецЦикла;
	КонецЕсли;  
КонецПроцедуры