Процедура ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Наименование = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + " (Закупка товара: " + ЭтотОбъект.Номенклатура.Наименование + ")";
	КонецЦикла;
КонецПроцедуры

Процедура ОплатаПоставщикуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	БизнесПроцесс = Задача.БизнесПроцесс;
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ЗакупкаУПоставщика.ТочкиМаршрута.ОплатаПоставщику Тогда
		Отказ = НЕ ЗначениеЗаполнено(Задача.ОплатаПоставщику);
		Если Отказ = Истина Тогда
			Сообщить("Создайте документ ""Расход денежных средств"" и укажите его в задаче! ");
		Иначе
			БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
			БизнесПроцессОбъект.ОплатаПоставщику = Задача.ОплатаПоставщику;
			БизнесПроцессОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ЭтотОбъект.ПоставкаПодтверждена;
КонецПроцедуры
